# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
# Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв)
# в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов,
# то они разделяются дефисами. Фразы отделяются друг от друга пробелами.
# Стихотворение  Винни-Пух вбивает в программу с клавиатуры.
# В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке
#
# *Пример:*
#
# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да
#     **Вывод:** Парам пам-пам

# phrase = input("Введите фразу: ").lower()
# dict_ = ("у", "е", "ы", "а", "о", "э", "я", "и", "ю")
# count_phrase = []
# count = 0
# res = 0
# for i in range(len(phrase)):
#     if phrase[i] in dict_:
#         count += 1
#     if phrase[i] == ' ' or i == len(phrase) - 1:
#         count_phrase.append(count)
#         print(count)
#         count = 0
# for i in count_phrase:
#     if i != count_phrase[0]:
#         print('Пам парам')
#         res = 1
#         break
# if res == 0:
#     print('Парам пам-пам')


# """version 2"""
# def rythm(phrase = 'пара-ра-рам рам-пам-папам па-ра-па-да'):
#     phrase = phrase.lower().split()
#     dict_ = ("у", "е", "ы", "а", "о", "э", "я", "и", "ю", "я")
#     if len(set(map(lambda word: len([ch for ch in word if ch in dict_]), phrase))) == 1:
#         return 'Парам пам-пам'
#     return 'Пам парам'

# print(rythm())

# Задача 36: Напишите функцию print_operation_table(operation, num_rows=6, num_columns=6),
# которая принимает в качестве аргумента функцию, вычисляющую элемент по номеру строки и столбца.
# Аргументы num_rows и num_columns указывают число строк и столбцов таблицы, которые должны быть распечатаны.
# Нумерация строк и столбцов идет с единицы (подумайте, почему не с нуля).
# Примечание: бинарной операцией называется любая операция, у которой ровно два аргумента, как, например, у операции умножения.
#
# *Пример:*
#
# **Ввод:** `print_operation_table(lambda x, y: x * y) `
# **Вывод:**
# 1 2 3 4 5 6
#
# 2 4 6 8 10 12
# 3 6 9 12 15 18
# 4 8 12 16 20 24
# 5 10 15 20 25 30
# 6 12 18 24 30 36
#
def print_operation_table(operation, num_rows=6, num_columns=6):
         for i in range(1, num_rows + 1):
             for j in range(1, num_columns + 1):
                 if i != 1 and j != 1:
                     print(operation(j, i), end="\t")
                     if j == num_columns:
                         print()
                 elif i == 1:
                     print(j, end="\t")
                     if j == num_columns:
                         print()
                 else:
                     print(i, end="\t")
                     if j == num_columns:
                         print()

print_operation_table(lambda x,y: x * y)
